Table of Contents
 Class ProjectData
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Defines certain data about user project.
[OpenModelClass("CI.ProjectData.ProjectData,CI.ProjectData", "CI.ProjectData.IProjectData,CI.BasicTypes")]
public sealed class ProjectData : OpenObject
Inheritance
object
OpenObject
ProjectData
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Author
Gets or sets the project author.
public string Author { get; set; }
Property Value
string
 CodeDependentData
Code dependent data
public object CodeDependentData { get; set; }
Property Value
object
 Date
Gets or sets the date.
[OpenModelProperty("DateOfCreate")]
public DateTime Date { get; set; }
Property Value
DateTime
 Description
Gets or sets the description of project.
public string Description { get; set; }
Property Value
string
 Name
Gets or sets the name of project.
[OpenModelProperty("ProjectName")]
public string Name { get; set; }
Property Value
string
 Number
Gets or sets the number of project.
[OpenModelProperty("ProjectNo")]
public string Number { get; set; }
Property Value
string
 Edit this page